Catalogs/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Товары</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЦеныТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЦеныТоваров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Товары/Ext/ObjectModule.bsl
&НаСервере 
Функция ПолучитьЦену(СсылкаНаОбъект)
    Запрос = Новый Запрос;
     Запрос.Текст =
      "ВЫБРАТЬ
		|	ЦеныТоваров.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныТоваров КАК ЦеныТоваров
		|ГДЕ 
		|	ЦеныТоваров.Товар.Наименование = &Товар";
     
     Запрос.УстановитьПараметр("Товар", СсылкаНаОбъект);
    ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

    Если ВыборкаДетальныеЗаписи.Следующий() Тогда
     Возврат  ВыборкаДетальныеЗаписи.Цена;     
Иначе
    Возврат 0;
КонецЕсли;
      
КонецФункции

&НаСервере
Процедура ЗаписьJSON() Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл("C:\xampp\htdocs\avtorazborka\1c\test.json");
	ВыборкаГорода = Справочники.Товары.Выбрать();
	
	ЗаписьJSON.ЗаписатьНачалоМассива();	
                   Пока ВыборкаГорода.Следующий() Цикл
                      //ЗаписьJSON.ЗаписатьЗначение(Строка("Товары"));
                      ВыборкаКатегории = Справочники.Товары.Выбрать();
                          ЗаписьJSON.ЗаписатьНачалоОбъекта();
                          ЗаписьJSON.ЗаписатьИмяСвойства("name");
                          ЗаписьJSON.ЗаписатьЗначение(Строка( ВыборкаГорода.Наименование));
                          ЗаписьJSON.ЗаписатьИмяСвойства("opisanie");
                          ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаГорода.Описание));
						  ЗаписьJSON.ЗаписатьИмяСвойства("artikul");
                          ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаГорода.Артикул));
						  ЗаписьJSON.ЗаписатьИмяСвойства("marka");
                          ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаГорода.Марка));
						  ЗаписьJSON.ЗаписатьИмяСвойства("model");
                          ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаГорода.Модель));
						  ЗаписьJSON.ЗаписатьИмяСвойства("path");
                          ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаГорода.Путь));
						  ЗаписьJSON.ЗаписатьИмяСвойства("price");
                          ЗаписьJSON.ЗаписатьЗначение(Строка(ПолучитьЦену(ВыборкаГорода.ПолучитьОбъект().Наименование)));
						  Сообщить(ПолучитьЦену(ВыборкаГорода.ПолучитьОбъект().Наименование));
                          ЗаписьJSON.ЗаписатьКонецОбъекта();
				  КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();
	СериализованнаяСтрока = ЗаписьJSON.Закрыть();
	
КонецПроцедуры
